/** @type {import('./en.js').Locale } */
const ua = {
	btn: {
		set_alarm: 'встановити',
		add: 'додати',
		subtrack: 'відняти',
		calculate: 'розрахувати',
		copy_link: 'копіювати посилання',
		confirm: 'підтвердити',
		edit: 'редагувати',
		del: 'видалити',
		skip: 'пропустити',
		start: 'почати',
		restart: 'перезапустити',
		resume: 'відновити',
		stop: 'зупинити',
		next: 'наступний',
		reset: 'скинути',
		cycle: 'цикл',
		play: 'грати',
		mute: 'вимкнути звук',
		// pause: 'пауза'
		pause: 'зупинити'
	},
	// icon title and labels
	it: {
		add_alarm: 'додати будильник',
		add_timer: 'додати таймер зворотного відліку',
		settings: 'налаштування',
		menu: 'меню',

		//labels
		sequence: 'Послідовність',
		radio: 'Радіостанція',
		vol: 'Гучність',

		total_focus: 'фокус: загальний час на сьогодні',
		total_break: 'перерва: загальний час на сьогодні'
	},

	menu: {
		timers: 'Таймери',
		edit: 'Редагувати',
		info: 'інфо',
		pomodoro: 'Pomodoro',
		tools: 'Інструменти'
	},

	time: {
		date: 'Дата',
		time: 'Час',
		until: 'Час до',
		expired: 'Термін минув',
		days: 'Днів',
		hh: 'Години',
		mm: 'Хвилини',
		ss: 'Секунди',
		mins: 'хв',

		year: 'рік',
		years: 'роки',
		month: 'місяць',
		months: 'місяці',
		weeks: 'тижні',
		day: 'день'
		// days: 'days'
	},

	opts: {
		group: {
			general: 'Загальні параметри',
			pomo: 'Параметри Помодоро',
			addons: 'Помодоро додатки'
		},

		notif: 'Сповіщення',
		alarm: 'Звуковий сигнал',
		wake_lock: 'Запобігти затемненню або блокуванню екрана',

		reminder: 'Нагадування про овертайм *',
		skip_break: 'Пропустити вибір перерви',
		autoshow_activities: 'Авто показ перерв',
		autostart_focus: 'Автозапуск Фокус',

		addons: {
			stopwatch: 'Секундомір',
			radio: 'Радіоплеєр',
			total_time: 'Загальний час на сьогодні',
			overtime: 'Поточний овертайм'
		},

		etc: {
			remind: '* Нагадувати про овертайм кожні 5 хвилин.',
			autoclose: 'Видалити після завершення',
			preserve_HMS: '* Зберегти значення ГГ:ХХ:СС'
		},

		theme: 'Тема'
	},

	timers: {
		pomodoro: {
			n: 'помодоро',
			h: 'Помодоро Таймер',
			phase: {
				focus: 'фокус',
				break: 'перерва'
			},
			b_type: {
				short: 'коротка',
				long: 'довга'
			},
			overtime: 'овертайм'
		},

		alarm_clock: {
			n: 'будильник',
			h: 'Будильник'
		},

		countdown: {
			n: 'таймер',
			h: 'Таймер Зворотного Відліку'
		},

		countdown_date: {
			n: 'таймер_до_дати',
			h: 'Таймер до Дати'
		},

		stopwatch: {
			n: 'секундомір',
			h: 'Секундомір'
		}
	},

	// routes
	r: {
		index: {
			head: {
				title: 'Безкоштовні онлайн таймери',
				desc: 'Сучасні та прості у використанні онлайн таймери : помодоро, таймер зворотного відліку, секундомір. Калькулятори дат. Ніяких відволікань. Світлий і темний режим. Працює на всіх розмірах екрана.',
				og: {
					title: 'Онлайн таймери',
					desc: 'Сучасні та прості у використанні онлайн таймери : помодоро, таймер зворотного відліку, секундомір. Калькулятори дат. Ніяких відволікань. Світлий і темний режим. Працює на всіх розмірах екрана.'
				}
			},
			body: {
				h1: 'Сучасні та прості у використанні онлайн таймери',
				h2: 'Калькулятори Дат'
			}
		},

		pomodoro: {
			head: {
				title: 'Помодоро таймер онлайн',
				desc: 'Настроюваний, мінімалістичний та естетичний онлайн таймер Pomodoro. Простий у використанні, допомагає підвищити продуктивність і зосередитися.',
				og: {
					title: 'Помодоро таймер онлайн',
					desc: 'Мінімалістичний та естетичний Pomodoro таймер. Простий у використанні, допомагає підвищити продуктивність і зосередитися.'
				}
			},
			body: {
				h1: 'Онлайн Помодоро Таймер',
				d1: 'Зручний на мобільних пристроях, простий у використанні, конфігурований, мінімалістичний та естетичний таймер продуктивності, на основі',
				l: {
					url: 'https://uk.wikipedia.org/wiki/%D0%9C%D0%B5%D1%82%D0%BE%D0%B4_Pomodoro',
					n: 'методу Pomodoro'
				},
				d2: '. На місії підвищити продуктивність і концентрацію, а також заохотити значущі перерви з заздалегідь визначеними діями.'
			}
		},

		stopwatch: {
			head: {
				title: 'Секундомір онлайн',
				desc: 'Простий у використанні, точний, приємний для ока онлайн секундомір.',
				og: {
					title: 'Онлайн Секундомір',
					desc: 'Простий у використанні, точний, приємний для ока онлайн секундомір.'
				}
			},
			body: {
				h1: 'Секундомір онлайн',
				desc: 'Простий у використанні, точний, приємний для ока онлайн секундомір.',
				h: 'Секундомір'
			}
		},

		alarm_clock: {
			head: {
				title: 'Будильник онлайн',
				desc: 'Простий у використанні та налаштуванні онлайн-будильник'
			},
			body: {
				h1: 'Онлайн Будильник',
				h3: 'Поточна дата й час:',
				p: ''
			}
		},

		countdown: {
			head: {
				title: 'Таймер зворотного відліку онлайн',
				desc: 'Простий у використанні, зручний для мобільних пристроїв, точний, сучасний, мінімалістичний онлайн таймер зворотного відліку ',
				og: {
					title: 'Онлайн таймер зворотного відліку',
					desc: 'Простий у використанні, точний, сучасний, мінімалістичний онлайн таймер зворотного відліку '
				}
			},
			body: {
				h1: 'Онлайн таймер зворотного відліку',
				desc: 'Простий у використанні, зручний для мобільних пристроїв, точний, сучасний, мінімалістичний онлайн таймер зворотного відліку.',
				desc_x1: 'Вибирайте з',
				desc_x2: 'часто встановлених таймерів',
				h: 'Таймер зворотного відліку'
			}
		},

		countdown_to: {
			head: {
				title: 'Таймер до дати онлайн ',
				desc: 'Простий, зручний та сучасний онлайн-таймер зворотного відліку до Дати'
			},
			body: {
				h1: 'Таймер до Дати',
				desc: 'Виберіть дату, час і часовий пояс, щоб запустити таймер.',
				h: 'Таймер до Дати'
			}
		},

		c_minutes: {
			head: {
				title: 'Популярні попередньо встановлені таймери',
				desc: 'Популярні попередньо встановлені таймери зворотного відліку в хвилинах'
			},
			body: {
				h1: 'Популярні таймери зворотного відліку, попередньо встановлені в хвилинах',
				h2: 'хвилин таймер'
				// h: 'Countdown'
			}
		},

		c_preset: {
			head: {
				title: (n) => `${n} хвилинний таймер онлайн`,
				desc: (n) =>
					`Запустіть попередньо встановлений ${n} хвилинний таймер зворотного відліку в один клік. Він безкоштовний і простий у використанні.`
			},
			body: {
				h1: (n) =>
					`Попередньо встановлений таймер зворотного відліку на ${n} хвилин.`,
				d1: 'Більше ',
				d2: 'попередньо встановлених таймерів'
				// h: 'Countdown'
			}
		},

		stats: {
			head: {
				title: 'Статистика',
				desc: 'Статистика діяльності зосередження та перерви'
			},
			body: {
				h: 'Статистика',

				date: 'Дата',
				focus: 'Фокус',
				break: 'Перерва',

				activity: 'Активність',
				total: 'Разом'
			}
		},
		snaps: {
			head: {
				title: 'Snapshots',
				desc: 'Збережіть і відновіть свої дані'
			},
			body: {
				h: 'Snapshots',
				download: 'скачати snaphot',
				restore: 'Відновити з snapshot',
				restore_ok: 'Відновлено! Будь ласка, оновіть сторінку.',
				desc: 'My Snapshots'
			}
		},
		sequences: {
			head: {
				title: 'Послідовності сеансів',
				desc: 'Список послідовностей'
			},
			body: {
				// desc: 'My Snapshots',
				add: 'Додати нову послідовність',
				h: 'Послідовності сеансів',
				e: {
					name: 'Назва',
					focus: 'Фокус',
					break: 'Перерва',
					l_break: 'Довга перерва',
					s_break: 'Коротка перерва',
					note: '* тривалість у хвилинах',
					sets: 'Кількість',

					time: 'Час',
					task: 'Завдання',
					// activity_list: 'Перелік активностей',
					activity_list: 'Список активностей',
					// activity_list: 'Активності',
					activity: 'Активність'
				}
			}
		},
		breaks: {
			head: {
				title: 'Перерви',
				desc: 'Перерви'
			},
			body: {
				h: 'Перерви',
				new: 'Новий список активностей',
				list: 'Список активностей',
				new_activity: 'Нова активність'
			}
		},
		radios: {
			head: {
				title: 'Радіостанції',
				desc: 'Список радіостанцій'
			},
			body: {
				h: 'Радіостанції',
				e: {
					add: 'Додати нову радіостанцію',
					reset: 'скинути значення за замовчуванням'
				}
			}
		},

		date2date: {
			head: {
				title: 'Калькулятор від Дати до Дати',
				desc: 'Обчисліть різницю між двома датами'
			},
			body: {
				h: 'Калькулятор від Дати до Дати',
				p: 'Обчисліть різницю між двома датами'
			}
		},

		add_sub_date: {
			head: {
				title: 'Додати або відняти Дату',
				desc: 'Додати (або відняти) роки, місяці, тижні та дні до (від) дати.'
			},
			body: {
				h: 'Додати або відняти Дату',
				p: 'Додати (або відняти) роки, місяці, тижні та дні до (від) дати'
			}
		}
	}
};

export default ua;
